#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/nextbnb/nextbnb/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/nextbnb/nextbnb

To view this run in a browser, visit:
https://app.terraform.io/app/do-it-simple/nextbnb/runs/run-hCXcuQo1LjwKNrrL

Waiting for the plan to start...

Terraform v1.0.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.networking.aws_vpc.nextbnb-vpc: Refreshing state... [id=vpc-0650a16f203e11f33]
module.networking.aws_default_route_table.nextbnb-public-route-table: Refreshing state... [id=rtb-0b1c729edbe58fb43]
module.networking.aws_route_table_association.nextbnb-private-route-table: Refreshing state... [id=rtbassoc-04f5aa1f383768344]
module.networking.aws_route_table_association.nextbnb-public-route-table: Refreshing state... [id=rtbassoc-0bd4aa9ec2ebb9bdf]
module.networking.aws_subnet.public-subnet: Refreshing state... [id=subnet-0c5c7d8b34dae10fd]
module.networking.aws_route_table.nextbnb-private-route-table: Refreshing state... [id=rtb-07ce1424d930688ff]
module.networking.aws_subnet.private-subnet: Refreshing state... [id=subnet-0c2c7d96e0df43b36]
module.auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-1_ySpdtGQDh]
module.services.aws_sqs_queue.terraform_dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/776733965771/dead_letter_queue]
module.networking.aws_internet_gateway.nextbnb_internet_gateway: Refreshing state... [id=igw-0ddf3d1c0ad1ba22b]
module.auth.aws_sqs_queue.terraform_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/776733965771/auth-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.auth.aws_cognito_user_pool.pool has been changed
  ~ resource "aws_cognito_user_pool" "pool" {
        id                        = "us-east-1_ySpdtGQDh"
        name                      = "nextbnb-pool"
      + tags                      = {}
        # (8 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # module.auth.aws_sqs_queue.terraform_queue has been changed
  ~ resource "aws_sqs_queue" "terraform_queue" {
        id                                = "https://sqs.us-east-1.amazonaws.com/776733965771/auth-service"
        name                              = "auth-service"
      + tags                              = {}
        # (12 unchanged attributes hidden)
    }
  # module.networking.aws_default_route_table.nextbnb-public-route-table has been changed
  ~ resource "aws_default_route_table" "nextbnb-public-route-table" {
        id                     = "rtb-0b1c729edbe58fb43"
      + propagating_vgws       = []
        tags                   = {
            "Name" = "nextbnb-public-route-table"
        }
        # (6 unchanged attributes hidden)
    }
  # module.networking.aws_route_table_association.nextbnb-private-route-table has been changed
  ~ resource "aws_route_table_association" "nextbnb-private-route-table" {
        id             = "rtbassoc-04f5aa1f383768344"
        # (2 unchanged attributes hidden)
    }
  # module.networking.aws_route_table_association.nextbnb-public-route-table has been changed
  ~ resource "aws_route_table_association" "nextbnb-public-route-table" {
        id             = "rtbassoc-0bd4aa9ec2ebb9bdf"
        # (2 unchanged attributes hidden)
    }
  # module.services.aws_sqs_queue.terraform_dead_letter_queue has been changed
  ~ resource "aws_sqs_queue" "terraform_dead_letter_queue" {
        id                                = "https://sqs.us-east-1.amazonaws.com/776733965771/dead_letter_queue"
        name                              = "dead_letter_queue"
      + tags                              = {}
        # (11 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.networking.aws_default_route_table.nextbnb-public-route-table will be destroyed
  - resource "aws_default_route_table" "nextbnb-public-route-table" {
      - arn                    = "arn:aws:ec2:us-east-1:776733965771:route-table/rtb-0b1c729edbe58fb43" -> null
      - default_route_table_id = "rtb-0b1c729edbe58fb43" -> null
      - id                     = "rtb-0b1c729edbe58fb43" -> null
      - owner_id               = "776733965771" -> null
      - propagating_vgws       = [] -> null
      - route                  = [] -> null
      - tags                   = {
          - "Name" = "nextbnb-public-route-table"
        } -> null
      - tags_all               = {
          - "Name" = "nextbnb-public-route-table"
        } -> null
      - vpc_id                 = "vpc-0650a16f203e11f33" -> null
    }

  # module.networking.aws_default_route_table.nextbnb_public_route_table will be created
  + resource "aws_default_route_table" "nextbnb_public_route_table" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "nextbnb-public-route-table"
        }
      + tags_all               = {
          + "Name" = "nextbnb-public-route-table"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_internet_gateway.nextbnb_internet_gateway will be updated in-place
  ~ resource "aws_internet_gateway" "nextbnb_internet_gateway" {
        id       = "igw-0ddf3d1c0ad1ba22b"
        tags     = {
            "Name" = "nextbnb-internet-gateway"
        }
      ~ vpc_id   = "vpc-0650a16f203e11f33" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.networking.aws_route_table.nextbnb-private-route-table will be destroyed
  - resource "aws_route_table" "nextbnb-private-route-table" {
      - arn              = "arn:aws:ec2:us-east-1:776733965771:route-table/rtb-07ce1424d930688ff" -> null
      - id               = "rtb-07ce1424d930688ff" -> null
      - owner_id         = "776733965771" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "nextbnb-private-route-table"
        } -> null
      - tags_all         = {
          - "Name" = "nextbnb-private-route-table"
        } -> null
      - vpc_id           = "vpc-0650a16f203e11f33" -> null
    }

  # module.networking.aws_route_table.nextbnb_private_route_table will be created
  + resource "aws_route_table" "nextbnb_private_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "nextbnb-private-route-table"
        }
      + tags_all         = {
          + "Name" = "nextbnb-private-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.nextbnb-private-route-table will be destroyed
  - resource "aws_route_table_association" "nextbnb-private-route-table" {
      - id             = "rtbassoc-04f5aa1f383768344" -> null
      - route_table_id = "rtb-07ce1424d930688ff" -> null
      - subnet_id      = "subnet-0c2c7d96e0df43b36" -> null
    }

  # module.networking.aws_route_table_association.nextbnb-public-route-table will be destroyed
  - resource "aws_route_table_association" "nextbnb-public-route-table" {
      - id             = "rtbassoc-0bd4aa9ec2ebb9bdf" -> null
      - route_table_id = "rtb-0b1c729edbe58fb43" -> null
      - subnet_id      = "subnet-0c5c7d8b34dae10fd" -> null
    }

  # module.networking.aws_route_table_association.nextbnb_private_route_table will be created
  + resource "aws_route_table_association" "nextbnb_private_route_table" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.nextbnb_public_route_table will be created
  + resource "aws_route_table_association" "nextbnb_public_route_table" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_subnet.private-subnet will be destroyed
  - resource "aws_subnet" "private-subnet" {
      - arn                             = "arn:aws:ec2:us-east-1:776733965771:subnet/subnet-0c2c7d96e0df43b36" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-east-1b" -> null
      - availability_zone_id            = "use1-az2" -> null
      - cidr_block                      = "10.0.2.0/24" -> null
      - id                              = "subnet-0c2c7d96e0df43b36" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "776733965771" -> null
      - tags                            = {
          - "Name" = "nextbnb-private-subnet"
        } -> null
      - tags_all                        = {
          - "Name" = "nextbnb-private-subnet"
        } -> null
      - vpc_id                          = "vpc-0650a16f203e11f33" -> null
    }

  # module.networking.aws_subnet.private_subnet will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "nextbnb-private-subnet"
        }
      + tags_all                        = {
          + "Name" = "nextbnb-private-subnet"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.public-subnet will be destroyed
  - resource "aws_subnet" "public-subnet" {
      - arn                             = "arn:aws:ec2:us-east-1:776733965771:subnet/subnet-0c5c7d8b34dae10fd" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-east-1a" -> null
      - availability_zone_id            = "use1-az1" -> null
      - cidr_block                      = "10.0.1.0/24" -> null
      - id                              = "subnet-0c5c7d8b34dae10fd" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "776733965771" -> null
      - tags                            = {
          - "Name" = "nextbnb-public-subnet"
        } -> null
      - tags_all                        = {
          - "Name" = "nextbnb-public-subnet"
        } -> null
      - vpc_id                          = "vpc-0650a16f203e11f33" -> null
    }

  # module.networking.aws_subnet.public_subnet will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "nextbnb-public-subnet"
        }
      + tags_all                        = {
          + "Name" = "nextbnb-public-subnet"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_vpc.nextbnb-vpc will be destroyed
  - resource "aws_vpc" "nextbnb-vpc" {
      - arn                              = "arn:aws:ec2:us-east-1:776733965771:vpc/vpc-0650a16f203e11f33" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-076c2912c1adc3e24" -> null
      - default_route_table_id           = "rtb-0b1c729edbe58fb43" -> null
      - default_security_group_id        = "sg-0b2f0b569cb50dd25" -> null
      - dhcp_options_id                  = "dopt-b17af4cb" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = true -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0650a16f203e11f33" -> null
      - instance_tenancy                 = "default" -> null
      - main_route_table_id              = "rtb-0b1c729edbe58fb43" -> null
      - owner_id                         = "776733965771" -> null
      - tags                             = {
          - "Name" = "nextbnb-vpc"
        } -> null
      - tags_all                         = {
          - "Name" = "nextbnb-vpc"
        } -> null
    }

  # module.networking.aws_vpc.nextbnb_vpc will be created
  + resource "aws_vpc" "nextbnb_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "nextbnb-vpc"
        }
      + tags_all                         = {
          + "Name" = "nextbnb-vpc"
        }
    }

Plan: 7 to add, 1 to change, 7 to destroy.


```

</details>

*Pusher: @kokiebisu, Action: `pull_request`*